kspraveeen/sdk-nrf/drivers/wifi/nrf71/src/common/util_shell.c
/*
 * Copyright (c) 2024 Nordic Semiconductor ASA
 *
 * SPDX-License-Identifier: Apache-2.0
 */

/* @file
 * @brief NRF Wi-Fi util shell module
 */
#include <stdlib.h>
#include <string.h>
#include <zephyr/kernel.h>
#include <zephyr/sys/sys_heap.h>
#include <common/fw_if/nrf71_wifi_ctrl.h>
#include <common/util.h>
#include <common/wifi_ipc.h>
#include <system/fmac_api.h>
#include <common/mem_mgmt.h>
#include <system/core.h>
#include <system/wifi_util.h>
#include <system/fmac_tx.h>
#include <common/mac_addr.h>


extern struct nrf_wifi_drv_priv_zep rpu_drv_priv_zep;
struct nrf_wifi_ctx_zep *ctx = &rpu_drv_priv_zep.rpu_ctx_zep;

static bool check_valid_data_rate(const struct shell *sh,
				  unsigned char rate_flag,
				  unsigned int data_rate)
{
	bool ret = false;

	switch (rate_flag) {
	case RPU_TPUT_MODE_LEGACY:
		if ((data_rate == 1) ||
		    (data_rate == 2) ||
		    (data_rate == 55) ||
		    (data_rate == 11) ||
		    (data_rate == 6) ||
		    (data_rate == 9) ||
		    (data_rate == 12) ||
		    (data_rate == 18) ||
		    (data_rate == 24) ||
		    (data_rate == 36) ||
		    (data_rate == 48) ||
		    (data_rate == 54)) {
			ret = true;
		}
		break;
	case RPU_TPUT_MODE_HT:
	case RPU_TPUT_MODE_HE_SU:
	case RPU_TPUT_MODE_VHT:
		if ((data_rate >= 0) && (data_rate <= 7)) {
			ret = true;
		}
		break;
	case RPU_TPUT_MODE_HE_ER_SU:
		if (data_rate >= 0 && data_rate <= 2) {
			ret = true;
		}
		break;
	default:
		shell_fprintf(sh,
			      SHELL_ERROR,
			      "%s: Invalid rate_flag %d\n",
			      __func__,
			      rate_flag);
		break;
	}

	return ret;
}


int nrf_wifi_util_conf_init(struct rpu_conf_params *conf_params)
{
	if (!conf_params) {
		return -ENOEXEC;
	}

	memset(conf_params, 0, sizeof(*conf_params));

	/* Initialize values which are other than 0 */
	conf_params->he_ltf = -1;
	conf_params->he_gi = -1;
	return 0;
}


static int nrf_wifi_util_set_he_ltf(const struct shell *sh,
				    size_t argc,
				    const char *argv[])
{
	char *ptr = NULL;
	unsigned long he_ltf = 0;

	if (ctx->conf_params.set_he_ltf_gi) {
		shell_fprintf(sh,
			      SHELL_ERROR,
			      "Disable 'set_he_ltf_gi', to set 'he_ltf'\n");
		return -ENOEXEC;
	}

	he_ltf = strtoul(argv[1], &ptr, 10);

	if (he_ltf > 2) {
		shell_fprintf(sh,
			      SHELL_ERROR,
			      "Invalid HE LTF value(%lu).\n",
			      he_ltf);
		shell_help(sh);
		return -ENOEXEC;
	}

	ctx->conf_params.he_ltf = he_ltf;

	return 0;
}


static int nrf_wifi_util_set_he_gi(const struct shell *sh,
				   size_t argc,
				   const char *argv[])
{
	char *ptr = NULL;
	unsigned long he_gi = 0;

	if (ctx->conf_params.set_he_ltf_gi) {
		shell_fprintf(sh,
			      SHELL_ERROR,
			      "Disable 'set_he_ltf_gi', to set 'he_gi'\n");
		return -ENOEXEC;
	}

	he_gi = strtoul(argv[1], &ptr, 10);

	if (he_gi > 2) {
		shell_fprintf(sh,
			      SHELL_ERROR,
			      "Invalid HE GI value(%lu).\n",
			      he_gi);
		shell_help(sh);
		return -ENOEXEC;
	}

	ctx->conf_params.he_gi = he_gi;

	return 0;
}


static int nrf_wifi_util_set_he_ltf_gi(const struct shell *sh,
				       size_t argc,
				       const char *argv[])
{
	enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;
	char *ptr = NULL;
	unsigned long val = 0;

	val = strtoul(argv[1], &ptr, 10);

	if ((val < 0) || (val > 1)) {
		shell_fprintf(sh,
			      SHELL_ERROR,
			      "Invalid value(%lu).\n",
			      val);
		shell_help(sh);
		return -ENOEXEC;
	}

	status = nrf_wifi_sys_fmac_conf_ltf_gi(ctx->rpu_ctx,
					       ctx->conf_params.he_ltf,
					       ctx->conf_params.he_gi,
					       val);

	if (status != NRF_WIFI_STATUS_SUCCESS) {
		shell_fprintf(sh,
			      SHELL_ERROR,
			      "Programming ltf_gi failed\n");
		return -ENOEXEC;
	}

	ctx->conf_params.set_he_ltf_gi = val;

	return 0;
}

#ifdef CONFIG_NRF71_STA_MODE
static int nrf_wifi_util_set_uapsd_queue(const struct shell *sh,
					 size_t argc,
					 const char *argv[])
{
	enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;
	char *ptr = NULL;
	unsigned long val = 0;

	val = strtoul(argv[1], &ptr, 10);

	if ((val < UAPSD_Q_MIN) || (val > UAPSD_Q_MAX)) {
		shell_fprintf(sh,
			      SHELL_ERROR,
			      "Invalid value(%lu).\n",
			      val);
		shell_help(sh);
		return -ENOEXEC;
	}

	if (ctx->conf_params.uapsd_queue != val) {
		status = nrf_wifi_sys_fmac_set_uapsd_queue(ctx->rpu_ctx,
						       0,
						       val);

		if (status != NRF_WIFI_STATUS_SUCCESS) {
			shell_fprintf(sh,
				      SHELL_ERROR,
				      "Programming uapsd_queue failed\n");
			return -ENOEXEC;
		}

		ctx->conf_params.uapsd_queue = val;
	}

	return 0;
}
#endif /* CONFIG_NRF71_STA_MODE */


static int nrf_wifi_util_show_cfg(const struct shell *sh,
				  size_t argc,
				  const char *argv[])
{
	struct rpu_conf_params *conf_params = NULL;

	conf_params = &ctx->conf_params;

	shell_fprintf(sh,
		      SHELL_INFO,
		      "************* Configured Parameters ***********\n");
	shell_fprintf(sh,
		      SHELL_INFO,
		      "\n");

	shell_fprintf(sh,
		      SHELL_INFO,
		      "he_ltf = %d\n",
		      conf_params->he_ltf);

	shell_fprintf(sh,
		      SHELL_INFO,
		      "he_gi = %u\n",
		      conf_params->he_gi);

	shell_fprintf(sh,
		      SHELL_INFO,
		      "set_he_ltf_gi = %d\n",
		      conf_params->set_he_ltf_gi);

	shell_fprintf(sh,
		      SHELL_INFO,
		      "uapsd_queue = %d\n",
		      conf_params->uapsd_queue);

	shell_fprintf(sh,
		      SHELL_INFO,
		      "rate_flag = %d,  rate_val = %d\n",
		      ctx->conf_params.tx_pkt_tput_mode,
		      ctx->conf_params.tx_pkt_rate);
	return 0;
}

#ifdef CONFIG_NRF71_STA_MODE
static const char *ac_str(int ac)
{
	static const char * const names[NRF_WIFI_FMAC_AC_MAX] = {
		"BK", "BE", "VI", "VO", "MC"
	};

	if ((ac < 0) || (ac >= NRF_WIFI_FMAC_AC_MAX)) {
		return "??";
	}

	return names[ac];
}

/* One line per topic: what the tokens carried, and what stopped them. */
static void tx_token_stats_summary(const struct shell *sh,
				   struct nrf_wifi_sys_fmac_dev_ctx *sys_dev_ctx,
				   struct nrf_wifi_sys_fmac_priv *sys_fpriv)
{
	struct tx_token_stats *ts = &sys_dev_ctx->tx_config.token_stats;
	unsigned int cap = sys_fpriv->avail_ampdu_len_per_token;
	unsigned int tokens_used = 0;
	unsigned int max_in_flight = 0;
	unsigned int busy = 0;
	unsigned int starved = 0;
	unsigned int q_full = 0;
	unsigned int avg_pkts_x100;
	unsigned int avg_bytes;
	unsigned int stops;
	const char *limiter = "none";
	unsigned int limiter_cnt = 0;
	unsigned int i;

	for (i = 0; i < NRF71_MAX_TX_TOKENS; i++) {
		if (ts->token_cmds[i]) {
			tokens_used++;
		}
	}

	for (i = 0; i < NRF_WIFI_FMAC_AC_MAX; i++) {
		if (ts->max_outstanding_descs[i] > max_in_flight) {
			max_in_flight = ts->max_outstanding_descs[i];
		}
		busy += ts->token_get_busy[i];
		starved += ts->token_get_starved[i];
		q_full += ts->pend_q_full_drops[i];
	}

	avg_pkts_x100 = ts->tx_cmds ?
		(unsigned int)((ts->tx_cmd_pkts * 100ULL) / ts->tx_cmds) : 0U;
	avg_bytes = ts->tx_cmds ? (unsigned int)(ts->tx_cmd_bytes / ts->tx_cmds) : 0U;

	stops = ts->aggr_stop_size + ts->aggr_stop_count + ts->aggr_stop_mismatch +
		ts->aggr_stop_twt + ts->aggr_stop_q_empty;

	/* aggr_stop_q_empty only means the pending queue was drained by this
	 * command, which is the normal case; the host is only really failing to
	 * keep up if the token had to be returned to the free pool for lack of
	 * packets (token_acq) or if the pipe ran idle.
	 */
	if (ts->aggr_stop_count > limiter_cnt) {
		limiter_cnt = ts->aggr_stop_count;
		limiter = "aggr count cap";
	}
	if (ts->aggr_stop_size > limiter_cnt) {
		limiter_cnt = ts->aggr_stop_size;
		limiter = "token size cap";
	}
	if (ts->aggr_stop_mismatch > limiter_cnt) {
		limiter_cnt = ts->aggr_stop_mismatch;
		limiter = "SA/RA mismatch";
	}
	if (ts->aggr_stop_twt > limiter_cnt) {
		limiter_cnt = ts->aggr_stop_twt;
		limiter = "TWT sleep";
	}

