kspraveeen/sdk-nrf/drivers/wifi/nrf71/src/common/util_shell.c
	for (i = 0; i < TX_TOKEN_FILL_BUCKETS; i++) {
		if (ts->fill_hist[i] == 0) {
			continue;
		}

		shell_fprintf(sh, SHELL_INFO,
			      "%3u-%3u%% - %u cmd(s)\n",
			      i * (100U / TX_TOKEN_FILL_BUCKETS),
			      (i + 1) * (100U / TX_TOKEN_FILL_BUCKETS),
			      ts->fill_hist[i]);
	}

	shell_fprintf(sh, SHELL_INFO,
		      "\nTX cmds: %u, pkts: %u, data: %llu B, occupancy: %llu B, "
		      "max cmd: %u B\n",
		      ts->tx_cmds,
		      ts->tx_cmd_pkts,
		      ts->tx_cmd_data_bytes,
		      ts->tx_cmd_bytes,
		      ts->max_cmd_bytes);
	shell_fprintf(sh, SHELL_INFO,
		      "TX dones: %u, pipe busy: %llu us, idle: %llu us, "
		      "max cmds in flight: %u\n",
		      ts->tx_dones,
		      ts->pipe_busy_us,
		      ts->pipe_idle_us,
		      ts->max_cmds_in_flight);

	if (ts->tx_cmds) {
		unsigned int avg_pkts_x100 = (unsigned int)((ts->tx_cmd_pkts * 100ULL) /
							    ts->tx_cmds);
		unsigned int avg_bytes = (unsigned int)(ts->tx_cmd_bytes / ts->tx_cmds);
		unsigned int avg_pkt_len = ts->tx_cmd_pkts ?
			(unsigned int)(ts->tx_cmd_data_bytes / ts->tx_cmd_pkts) : 0U;

		shell_fprintf(sh, SHELL_INFO,
			      "avg_tx pkts/TX cmd: %u.%02u (of %u), "
			      "avg bytes/TX cmd: %u (%u%% of cap), avg pkt: %u B\n",
			      avg_pkts_x100 / 100U,
			      avg_pkts_x100 % 100U,
			      max_aggr,
			      avg_bytes,
			      cap ? ((avg_bytes * 100U) / cap) : 0U,
			      avg_pkt_len);
	} else {
		shell_fprintf(sh, SHELL_INFO, "avg_tx pkts/TX cmd: n/a\n");
	}

	aggr_stops = ts->aggr_stop_size + ts->aggr_stop_count + ts->aggr_stop_mismatch +
		     ts->aggr_stop_twt + ts->aggr_stop_q_empty;

	shell_fprintf(sh, SHELL_INFO,
		      "\n--- Why aggregation stopped (%u events) ---\n",
		      aggr_stops);
	shell_fprintf(sh, SHELL_INFO,
		      "size cap hit   : %u\n"
		      "count cap hit  : %u\n"
		      "SA/RA mismatch : %u\n"
		      "TWT sleep      : %u\n"
		      "pend_q empty   : %u\n"
		      "forced single  : %u\n",
		      ts->aggr_stop_size,
		      ts->aggr_stop_count,
		      ts->aggr_stop_mismatch,
		      ts->aggr_stop_twt,
		      ts->aggr_stop_q_empty,
		      ts->aggr_forced_single);

	shell_fprintf(sh, SHELL_INFO,
		      "\n--- Per-AC token accounting ---\n"
		      "a token is requested for every packet handed to the driver, so once\n"
		      "the tokens of an AC are in flight every further request is 'busy'\n"
		      "and the packet waits on the pending queue for a TX done; only\n"
		      "'starved' (no token while the AC has nothing in flight) is a fault\n");
	shell_fprintf(sh, SHELL_INFO,
		      "%-4s %9s %7s %10s %8s %8s %9s %7s %7s\n",
		      "ac", "reserved", "spare", "busy", "starved", "in_fl",
		      "max_in_fl", "max_q", "q_full");

	for (i = 0; i < NRF_WIFI_FMAC_AC_MAX; i++) {
		total_gets += ts->reserved_token_get[i] + ts->spare_token_get[i];
		total_busy += ts->token_get_busy[i];
		total_starved += ts->token_get_starved[i];

		shell_fprintf(sh, SHELL_INFO,
			      "%-4s %9u %7u %10u %8u %8u %9u %7u %7u\n",
			      ac_str(i),
			      ts->reserved_token_get[i],
			      ts->spare_token_get[i],
			      ts->token_get_busy[i],
			      ts->token_get_starved[i],
			      sys_dev_ctx->tx_config.outstanding_descs[i],
			      ts->max_outstanding_descs[i],
			      ts->max_pending_qlen[i],
			      ts->pend_q_full_drops[i]);
	}

	shell_fprintf(sh, SHELL_INFO,
		      "token gets: %u, busy: %u, starved: %u, spare AC switches: %u\n",
		      total_gets,
		      total_busy,
		      total_starved,
		      ts->spare_token_ac_switch);
	shell_fprintf(sh, SHELL_INFO,
		      "token re-use: %u.%02u TX done(s) per token get\n",
		      total_gets ? (ts->tx_dones / total_gets) : 0U,
		      total_gets ? (((ts->tx_dones * 100U) / total_gets) % 100U) : 0U);

	shell_fprintf(sh, SHELL_INFO,
		      "\n--- Host TX path ---\n");
	shell_fprintf(sh, SHELL_INFO,
		      "if_send calls: %u, accepted: %u\n",
		      ts->if_send_calls,
		      ts->if_send_accepted);
	shell_fprintf(sh, SHELL_INFO,
		      "of which held on the pending queue (no token/aggregating/PS): %u "
		      "(%u%%)\n",
		      ts->pkts_queued,
		      ts->if_send_accepted ?
			      ((ts->pkts_queued * 100U) / ts->if_send_accepted) : 0U);
	shell_fprintf(sh, SHELL_INFO,
		      "if_send drops: no_nbuf: %u, unknown_peer: %u, not_ready: %u, "
		      "fmac_fail: %u\n",
		      ts->if_drop_no_nbuf,
		      ts->if_drop_unknown_peer,
		      ts->if_drop_not_ready,
		      ts->if_drop_fmac_fail);
	shell_fprintf(sh, SHELL_INFO,
		      "host pkts: tx: %llu, tx_done: %llu, tx_drop: %llu\n",
		      (unsigned long long)sys_dev_ctx->host_stats.total_tx_pkts,
		      (unsigned long long)sys_dev_ctx->host_stats.total_tx_done_pkts,
		      (unsigned long long)sys_dev_ctx->host_stats.total_tx_drop_pkts);
}

static int nrf_wifi_util_tx_stats(const struct shell *sh,
				  size_t argc,
				  const char *argv[])
{
	int vif_index = -1;
	int peer_index = 0;
	int max_vif_index = MAX(MAX_NUM_APS, MAX_NUM_STAS);
	struct nrf_wifi_fmac_dev_ctx *fmac_dev_ctx = NULL;
	struct nrf_wifi_sys_fmac_priv *sys_fpriv = NULL;
	unsigned int tx_pending_pkts = 0;
	struct nrf_wifi_sys_fmac_dev_ctx *sys_dev_ctx = NULL;
	bool clear = false;
	bool verbose = false;
	int ret;

	for (size_t i = 2; i < argc; i++) {
		if (strcmp(argv[i], "clear") == 0) {
			clear = true;
		} else if (strcmp(argv[i], "-v") == 0) {
			verbose = true;
		} else {
			shell_fprintf(sh,
				      SHELL_ERROR,
				      "Invalid argument \"%s\".\n",
				      argv[i]);
			shell_help(sh);
			return -ENOEXEC;
		}
	}

	vif_index = atoi(argv[1]);
	if ((vif_index < 0) || (vif_index >= max_vif_index)) {
		shell_fprintf(sh,
			      SHELL_ERROR,
			      "Invalid vif index(%d).\n",
			      vif_index);
		shell_help(sh);
		return -ENOEXEC;
	}

	k_mutex_lock(&ctx->rpu_lock, K_FOREVER);
	if (!ctx->rpu_ctx) {
		shell_fprintf(sh,
			      SHELL_ERROR,
			      "RPU context not initialized\n");
		ret = -ENOEXEC;
		goto unlock;
	}

	fmac_dev_ctx = ctx->rpu_ctx;
	sys_dev_ctx = wifi_dev_priv(fmac_dev_ctx);
	sys_fpriv = wifi_fmac_priv(fmac_dev_ctx->fpriv);

	if (clear) {
		memset(&sys_dev_ctx->tx_config.token_stats,
		       0,
		       sizeof(sys_dev_ctx->tx_config.token_stats));
		sys_dev_ctx->tx_config.token_stats.window_start_cyc = k_cycle_get_32();
		shell_fprintf(sh,
			      SHELL_INFO,
			      "TX token stats cleared\n");
		ret = 0;
		goto unlock;
	}

	if (!verbose) {
		tx_token_stats_summary(sh, sys_dev_ctx, sys_fpriv);
		ret = 0;
		goto unlock;
	}

	/* TODO: Get peer_index from shell once AP mode is supported */
	shell_fprintf(sh,
		SHELL_INFO,
		"************* Tx Stats: vif(%d) peer(0) ***********\n",
		vif_index);

	for (int i = 0; i < NRF_WIFI_FMAC_AC_MAX ; i++) {
		tx_pending_pkts = (unsigned int)sys_dlist_len(
			&sys_dev_ctx->tx_config.pend_pkt_q[peer_index][i]);

		shell_fprintf(
			sh,
			SHELL_INFO,
			"Outstanding tokens: ac: %d (%s) -> %d (pending_q_len: %d)\n",
			i,
			ac_str(i),
			sys_dev_ctx->tx_config.outstanding_descs[i],
			tx_pending_pkts);
	}

	tx_token_stats_dump(sh, sys_dev_ctx, sys_fpriv);

	ret = 0;

unlock:
	k_mutex_unlock(&ctx->rpu_lock);
	return ret;
}
#endif /* CONFIG_NRF71_STA_MODE */


static int nrf_wifi_util_tx_rate(const struct shell *sh,
				 size_t argc,
				 const char *argv[])
{
	enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;
	char *ptr = NULL;
	long rate_flag = -1;
	long data_rate = -1;

	rate_flag = strtol(argv[1], &ptr, 10);

	if (rate_flag >= RPU_TPUT_MODE_MAX) {
		shell_fprintf(sh,
			      SHELL_ERROR,
			      "Invalid value %ld for rate_flags\n",
			      rate_flag);
		shell_help(sh);
		return -ENOEXEC;
	}


	if (rate_flag == RPU_TPUT_MODE_HE_TB) {
		data_rate = -1;
	} else {
		if (argc < 3) {
			shell_fprintf(sh,
				      SHELL_ERROR,
				      "rate_val needed for rate_flag = %ld\n",
				      rate_flag);
			shell_help(sh);
			return -ENOEXEC;
		}

