kspraveeen/sdk-nrf/drivers/wifi/nrf71/src/common/util_shell.c
static int nrf_wifi_util_heap(const struct shell *sh, size_t argc, char **argv)
{
	struct k_heap *ctrl_pool;
	struct k_heap *data_pool;
	struct sys_memory_stats stats;
	int err;

	ARG_UNUSED(argc);
	ARG_UNUSED(argv);

	nrf_wifi_mem_get_heaps(&ctrl_pool, &data_pool);

	err = sys_heap_runtime_stats_get(&ctrl_pool->heap, &stats);
	if (err) {
		shell_error(sh, "Failed to read control heap statistics (err %d)", err);
		return -ENOEXEC;
	}
	shell_print(sh, "Control pool:");
	shell_print(sh, "  free:           %zu", stats.free_bytes);
	shell_print(sh, "  allocated:      %zu", stats.allocated_bytes);
	shell_print(sh, "  max. allocated: %zu", stats.max_allocated_bytes);

	err = sys_heap_runtime_stats_get(&data_pool->heap, &stats);
	if (err) {
		shell_error(sh, "Failed to read data heap statistics (err %d)", err);
		return -ENOEXEC;
	}
	shell_print(sh, "Data pool:");
	shell_print(sh, "  free:           %zu", stats.free_bytes);
	shell_print(sh, "  allocated:      %zu", stats.allocated_bytes);
	shell_print(sh, "  max. allocated: %zu", stats.max_allocated_bytes);

	return 0;
}

static void nrf_wifi_util_dump_mac_addr_slots(const struct shell *sh, bool uicr)
{
	const char *block = uicr ? "UICR" : "FICR";

	for (unsigned char slot = 0; slot < NRF_WIFI_XICR_MAC_ADDR_SLOTS; slot++) {
		uint32_t low, high;
		int ret;

		ret = nrf_wifi_xicr_mac_addr_slot_read(uicr, slot, &low, &high);
		if (ret == -ENOTSUP) {
			shell_print(sh, "%s: not accessible", block);
			return;
		} else if (ret) {
			shell_error(sh, "%s MACADDR[%u]: read failed (err %d)",
				    block, slot, ret);
			continue;
		}

		shell_print(sh, "%s MACADDR[%u].LOW  = 0x%08X", block, slot, low);
		shell_print(sh, "%s MACADDR[%u].HIGH = 0x%08X", block, slot, high);

		if (nrf_wifi_mac_addr_regs_empty(low, high)) {
			shell_print(sh, "%s MACADDR[%u]      = not programmed",
				    block, slot);
			continue;
		}

		/* HIGH holds bits [47:24] of the address, LOW bits [23:0], both
		 * MSB first, so 00F4CE36 / 00112233 is F4:CE:36:11:22:33.
		 */
		shell_print(sh, "%s MACADDR[%u]      = %02X:%02X:%02X:%02X:%02X:%02X",
			    block, slot,
			    (uint8_t)(high >> 16), (uint8_t)(high >> 8), (uint8_t)high,
			    (uint8_t)(low >> 16), (uint8_t)(low >> 8), (uint8_t)low);
	}
}

static int nrf_wifi_util_mac_addr(const struct shell *sh, size_t argc, char **argv)
{
	ARG_UNUSED(argc);
	ARG_UNUSED(argv);

	nrf_wifi_util_dump_mac_addr_slots(sh, true);
	nrf_wifi_util_dump_mac_addr_slots(sh, false);

	for (unsigned char vif_idx = 0; vif_idx < MAX_NUM_VIFS; vif_idx++) {
		uint8_t mac_addr[WIFI_MAC_ADDR_LEN];
		int ret;

		ret = nrf_wifi_xicr_mac_addr_get(vif_idx, mac_addr, NULL);
		if (ret) {
			shell_error(sh, "VIF%u: no MAC address available (err %d)",
				    vif_idx, ret);
			continue;
		}

		shell_print(sh, "VIF%u resolved    = %02X:%02X:%02X:%02X:%02X:%02X",
			    vif_idx,
			    mac_addr[0], mac_addr[1], mac_addr[2],
			    mac_addr[3], mac_addr[4], mac_addr[5]);
	}

	return 0;
}

SHELL_STATIC_SUBCMD_SET_CREATE(
	nrf71_util,
	SHELL_CMD_ARG(he_ltf,
		      NULL,
		      "0 - 1x HE LTF\n"
		      "1 - 2x HE LTF\n"
		      "2 - 4x HE LTF                                        ",
		      nrf_wifi_util_set_he_ltf,
		      2,
		      0),
	SHELL_CMD_ARG(he_gi,
		      NULL,
		      "0 - 0.8 us\n"
		      "1 - 1.6 us\n"
		      "2 - 3.2 us                                           ",
		      nrf_wifi_util_set_he_gi,
		      2,
		      0),
	SHELL_CMD_ARG(set_he_ltf_gi,
		      NULL,
		      "0 - Disable\n"
		      "1 - Enable",
		      nrf_wifi_util_set_he_ltf_gi,
		      2,
		      0),
#ifdef CONFIG_NRF71_STA_MODE
	SHELL_CMD_ARG(uapsd_queue,
		      NULL,
		      "<val> - 0 to 15",
		      nrf_wifi_util_set_uapsd_queue,
		      2,
		      0),
#endif /* CONFIG_NRF71_STA_MODE */
	SHELL_CMD_ARG(show_config,
		      NULL,
		      "Display the current configuration values",
		      nrf_wifi_util_show_cfg,
		      1,
		      0),
#ifdef CONFIG_NRF71_STA_MODE
	SHELL_CMD_ARG(tx_stats,
		      NULL,
		      "Displays a TX statistics summary: aggregation, token usage\n"
		      "and what is limiting the TX path\n"
		      "Parameters:\n"
		      "    vif_index: 0 - 1\n"
		      "    -v       : (optional) full per-token, histogram and per-AC dump\n"
		      "    clear    : (optional) reset the TX token counters\n",
		      nrf_wifi_util_tx_stats,
		      2,
		      2),
#endif /* CONFIG_NRF71_STA_MODE */
	SHELL_CMD_ARG(tx_rate,
		      NULL,
		      "Sets TX data rate to either a fixed value or AUTO\n"
		      "Parameters:\n"
		      "    <rate_flag> : The TX data rate type to be set, where:\n"
		      "        0 - LEGACY\n"
		      "        1 - HT\n"
		      "        2 - VHT\n"
		      "        3 - HE_SU\n"
		      "        4 - HE_ER_SU\n"
		      "        5 - AUTO\n"
		      "    <rate_val> : The TX data rate value to be set, valid values are:\n"
		      "        Legacy : <1, 2, 55, 11, 6, 9, 12, 18, 24, 36, 48, 54>\n"
		      "        Non-legacy: <MCS index value between 0 - 7>\n"
		      "        AUTO: <No value needed>\n",
		      nrf_wifi_util_tx_rate,
		      2,
		      1),
	SHELL_CMD_ARG(show_vers,
		      NULL,
		      "Display the driver and the firmware versions",
		      nrf_wifi_util_show_vers,
		      1,
		      0),
	SHELL_CMD_ARG(heap,
		      NULL,
		      "Control and data pool heap usage statistics",
		      nrf_wifi_util_heap,
		      1,
		      0),
#if !defined(CONFIG_NRF71_RADIO_TEST) && !defined(CONFIG_NRF71_OFFLOADED_RAW_TX)
	SHELL_CMD_ARG(rpu_stats,
		      NULL,
		      "Display RPU stats "
		      "Parameters: umac or lmac or phy or all (default)",
		      nrf_wifi_util_dump_rpu_stats,
		      1,
		      1),
	SHELL_CMD_ARG(clear_rpu_stats,
		      NULL,
		      "Clear RPU stats. Parameters: umac|lmac|phy|all (default)",
		      nrf_wifi_util_clear_rpu_stats,
		      1,
		      1),
	SHELL_CMD_ARG(debug_stats,
		      NULL,
		      "Request debug stats from RPU. Parameters: umac|lmac|phy",
		      nrf_wifi_util_debug_stats,
		      1,
		      1),
	SHELL_CMD_ARG(umac_int_stats,
		      NULL,
		      "Request UMAC internal (memory pool) stats from RPU",
		      nrf_wifi_util_umac_int_stats,
		      1,
		      0),
#endif /* !CONFIG_NRF71_RADIO_TEST && !CONFIG_NRF71_OFFLOADED_RAW_TX*/
#ifdef CONFIG_NRF_WIFI_RPU_RECOVERY
	SHELL_CMD_ARG(rpu_recovery_test,
		      NULL,
		      "Trigger RPU recovery",
		      nrf_wifi_util_trigger_rpu_recovery,
		      1,
		      0),
	SHELL_CMD_ARG(rpu_recovery_info,
		      NULL,
		      "Dump RPU recovery information",
		      nrf_wifi_util_rpu_recovery_info,
		      1,
		      0),
#endif /* CONFIG_NRF_WIFI_RPU_RECOVERY */
	SHELL_CMD_ARG(mac_addr,
		      NULL,
		      "Dump the MAC addresses programmed in the xICR registers\n"
		      "and the address each interface resolves to",
		      nrf_wifi_util_mac_addr,
		      1,
		      0),
	SHELL_SUBCMD_SET_END);


SHELL_SUBCMD_ADD((nrf71), util, &nrf71_util, "nRF70 utility commands\n", NULL, 0, 0);


static int nrf_wifi_util_init(void)
{

	if (nrf_wifi_util_conf_init(&ctx->conf_params) < 0) {
		return -1;
	}

	return 0;
}


SYS_INIT(nrf_wifi_util_init,
	 APPLICATION,
	 CONFIG_APPLICATION_INIT_PRIORITY);
